backend/app/models/attendance.rb

  def one_check_in_per_day
    return unless check_in

    existing = employee.attendances
      .where(check_in: check_in.beginning_of_day..check_in.end_of_day)
      .where.not(id: id)

    if existing.exists?
---
SELECT 1 AS one FROM "attendances" WHERE "attendances"."employee_id" = $1 AND "attendances"."check_in" BETWEEN $2 AND $3 AND "attendances"."id" != $4 LIMIT $5  [["employee_id", 4], ["check_in", "2026-03-06 00:00:00"], ["check_in", "2026-03-06 23:59:59.999999"], ["id", 3], ["LIMIT", 1]]