backend/app/controllers/attendances_controller.rb

  def create
    attendance = Attendance.new(attendance_params)

    if attendance.save
---
INSERT INTO "attendances" ("employee_id", "check_in", "check_out", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["employee_id", 5], ["check_in", "2026-03-06 17:37:26.017000"], ["check_out", nil], ["created_at", "2026-03-06 17:37:26.203489"], ["updated_at", "2026-03-06 17:37:26.203489"]]

  def update
    attendance = Attendance.find(params[:id])

    if attendance.update(attendance_params)
---
SELECT "attendances".* FROM "attendances" WHERE "attendances"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "attendances" SET "check_out" = $1, "updated_at" = $2 WHERE "attendances"."id" = $3  [["check_out", "2026-03-06 17:37:29.384000"], ["updated_at", "2026-03-06 17:37:29.422089"], ["id", 2]]