backend/app/controllers/employees_controller.rb

INSERT INTO "employees" ("name", "last_name", "position", "salary", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "1"], ["last_name", "2"], ["position", "3"], ["salary", "4.0"], ["created_at", "2026-03-06 15:10:12.273244"], ["updated_at", "2026-03-06 15:10:12.273244"]]
---
  def create
    employee = Employee.new(employee_params)

    if employee.save

UPDATE "employees" SET "name" = $1, "last_name" = $2, "position" = $3, "salary" = $4, "updated_at" = $5 WHERE "employees"."id" = $6  [["name", "11"], ["last_name", "22"], ["position", "33"], ["salary", "44.0"], ["updated_at", "2026-03-06 16:26:49.167806"], ["id", 3]]
---
  def update
    if @employee.update(employee_params)