backend/app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees" WHERE (name ILIKE $1 OR last_name ILIKE $2)  [[nil, "%NA%"], [nil, "%NA%"]]
---
  def index
  if params[:keyword].present?
    employees = Employee.where(
      "name ILIKE :q OR last_name ILIKE :q",
      q: "%#{params[:keyword]}%"
    )
  else
    employees = Employee.all

SELECT "attendances".* FROM "attendances" WHERE "attendances"."employee_id" = $1  [["employee_id", 1]]
SELECT "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    employee = Employee.includes(:attendances).find(params[:id])

INSERT INTO "employees" ("name", "last_name", "position", "salary", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "1"], ["last_name", "2"], ["position", "3"], ["salary", "4.0"], ["created_at", "2026-03-06 18:01:41.645657"], ["updated_at", "2026-03-06 18:01:41.645657"]]
---
  def create
    employee = Employee.new(employee_params)

    if employee.save

UPDATE "employees" SET "name" = $1, "last_name" = $2, "position" = $3, "salary" = $4, "updated_at" = $5 WHERE "employees"."id" = $6  [["name", "11"], ["last_name", "22"], ["position", "33"], ["salary", "44.0"], ["updated_at", "2026-03-06 18:01:47.170526"], ["id", 7]]
---
  def update
    if @employee.update(employee_params)